Tekla Open API Reference for Tekla Structures 2025
Reinforcement.IsGeometryValid Method
 Tells whether the geometry of a reinforcement object is valid or not.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsGeometryValid()
Public Function IsGeometryValid As Boolean
Return Value
Type: Boolean
True if the geometry of the reinforcement is valid, false otherwise.
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace